{"id":253,"date":"2025-04-30T20:51:05","date_gmt":"2025-04-30T20:51:05","guid":{"rendered":"https:\/\/liberatoryai.datainfrastructures.org\/?p=253"},"modified":"2025-04-30T22:04:51","modified_gmt":"2025-04-30T22:04:51","slug":"ai-must-be-built-under-humane-conditions","status":"publish","type":"post","link":"https:\/\/liberatoryai.datainfrastructures.org\/ai-must-be-built-under-humane-conditions\/","title":{"rendered":"AI must be built under humane conditions"},"content":{"rendered":"\n<p>A liberatory AI ecosystem would transform bad labor conditions by ensuring that those most affected by technological systems have a say in how they are designed and governed.<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>AI is an African feminist issue. The convergence of automated systems, algorithmic governance, and digital infrastructure in African contexts has direct implications for African women&#8217;s lives, bodies, and futures. As technological systems increasingly mediate social, political, and economic relations, they become inseparable from the broader struggles for liberation that have always been central to African feminist organizing.<\/p>\n\n\n\n<p>An African feminist approach recognizes the embodied nature of technological systems. While corporate AI presents itself as disembodied and universal, African feminist thought insists on recognizing the physical bodies and lands that make technology possible. As the feminist historian Stephanie Camp reminds us, African women&#8217;s bodies were the scripts upon which the scripts of labor and enslavement was read and perpetuated, creating a coloniality\/modernity where African women continue to pay the price for the indexing of humanity. A liberatory AI would acknowledge these embodied realities rather than obscuring them.<\/p>\n\n\n\n<p>This embodied understanding leads to practical differences in how technology is developed and deployed. Content moderators would be recognized as tech workers rather than disposable labor. Data sovereignty would be understood as a crucial aspect of both personal and collective autonomy. The environmental impacts of technological infrastructure would be centered rather than externalized.<\/p>\n\n\n\n<p>An African feminist approach to AI would transform tech governance by insisting on pluralistic, democratic control over technological systems. A liberatory AI ecosystem would transform this dynamic by ensuring that those most affected by technological systems have a say in how they are designed and governed. This would mean moving beyond corporate philanthropy or &#8220;ethical\/responsible AI&#8221; initiatives that maintain existing power structures while making superficial adjustments.<\/p>\n\n\n\n<p>Liberatory AI ecosystem must be grounded in the freedom dreams of those who have historically borne the costs of technological &#8220;progress.&#8221; Drawing from African feminist epistemologies offers us alternative frameworks for understanding and developing technologies that center relationality, care, freedom and plural frameworks of the human, rather than extraction, domination, and control.<\/p>\n\n\n\n<p>African feminist scholar Filomina Chioma Steady provides a foundation for this reimagining when she positions her conception of feminism as emerging from what she terms &#8220;polarizations and conflicts—representing some of the worst and most chronic forms of human suffering&#8221;—and prompts us toward a broad struggle for social and humanistic transformation. This understanding allows us to envision a liberatory AI that critiques the racial, sexual, class, and cultural dimensions of technological oppression to produce equitable technologies through which humans are viewed as whole beings rather than data points to be extracted or bodies to be exploited.<\/p>\n\n\n\n<p>What would this look like in practice? A liberatory AI ecosystem would acknowledge the full humanity of all people involved in its creation, deployment, and use. This means recognizing content moderators not as disposable labor but as essential tech workers deserving of fair compensation, psychological support, and dignity.&nbsp;<\/p>\n\n\n\n<p>It recognizes that technological systems are never neutral but always encode particular ways of seeing and organizing the world. Rather than positioning the white, male, wealthy technologist as the universal subject of technological development, a liberatory AI would center multiple ways of being human. This means moving beyond what Alexander Weheliye describes as the &#8220;racializing assemblages&#8221; that discipline humanity into full humans, not-quite-humans, and nonhumans. Instead of reproducing these hierarchies, liberatory AI would be built on a &#8220;technological plural humanism&#8221;—recognition that different cultural contexts offer distinct and valuable approaches to technology development.<\/p>\n\n\n\n<p>In the African context, this involves drawing on indigenous concepts of relationality and collective ownership. Many African societies have longstanding traditions that understand the individual as fundamentally embedded in community and the natural world. These epistemologies offer alternatives to the hyperindividualistic, extractive logics without soul that currently dominate AI development.<\/p>\n\n\n\n<p>The digital articulations of African feminist freedom dreams are already pointing the way toward such alternatives. The Ugandan feminist tech collective, <a href=\"https:\/\/pollicy.org\/\">Pollicy<\/a>, for instance, builds its policy advocacies around the logic of digital kinship, where people must have access to their own data and technologies must be developed with and for communities rather than imposed upon them.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Further Reading<\/strong><\/h3>\n\n\n\n<p><strong>Further Reading (Academic)<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Birhane, A. (2020). The Algorithmic Colonization of Africa. Script-ed, 17(2), 389-409.<\/li>\n\n\n\n<li>Camp, S. M. H. (2005). Closer to Freedom: Enslaved Women and Everyday Resistance in the Plantation South. United States: University of North Carolina Press.<\/li>\n\n\n\n<li>Jili, B. (2022). Chinese ICT and Smart City Initiatives in Kenya. Asia Policy 17(3), 40-50. <a href=\"https:\/\/dx.doi.org\/10.1353\/asp.2022.0051\">https:\/\/dx.doi.org\/10.1353\/asp.2022.0051<\/a>.&nbsp;<\/li>\n\n\n\n<li>Klein, L. &amp; D&#8217;Ignazio, C. (2024). Data Feminism for AI. ArXiv. <a href=\"https:\/\/doi.org\/10.1145\/3630106.3658543\">https:\/\/doi.org\/10.1145\/3630106.3658543<\/a>&nbsp;<\/li>\n\n\n\n<li>Mbembe, A. (2019). Necropolitics. Duke University Press.<\/li>\n\n\n\n<li>Ogundipe, M. (1994). Re-creating Ourselves: African Women &amp; Critical Transformations. Africa World Press.<\/li>\n\n\n\n<li>Steady, F. C. (1986). African Feminism: A Worldwide Perspective. In R. Terborg-Penn, S. Harley, &amp; A. Benton Rushing (Eds.), Women in Africa and the African Diaspora (pp. 3-24). Howard University Press.<\/li>\n\n\n\n<li>Weheliye, A. G. (2014). Habeas Viscus: Racializing Assemblages, Biopolitics, and Black Feminist Theories of the Human. Duke University Press.<\/li>\n\n\n\n<li>Wynter, S. (2003). Unsettling the Coloniality of Being\/Power\/Truth\/Freedom: Towards the Human, After Man, Its Overrepresentation—An Argument. CR: The New Centennial Review, 3(3), 257-337.<\/li>\n\n\n\n<li>Barrett, T., Okolo, C. T., Biira, B., Sherif, E., Zhang, A. X., &amp; Battle, L. (2025). African Data Ethics: A Discursive Framework for Black Decolonial Data Science. ArXiv. <a href=\"https:\/\/arxiv.org\/abs\/2502.16043\">https:\/\/arxiv.org\/abs\/2502.16043<\/a>&nbsp;<\/li>\n<\/ul>\n\n\n\n<p><strong>Further Reading (Popular Press)<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Benjamin, R. (2024). Imagination: A Manifesto (A Norton Short). United States: W. W. Norton.<\/li>\n\n\n\n<li>Faniyi, O. (2024, February 27). An African Feminist Manifesto. The Republic. <a href=\"https:\/\/republic.com.ng\/february-march-2024\/an-african-feminist-manifesto\/\">https:\/\/republic.com.ng\/february-march-2024\/an-african-feminist-manifesto\/<\/a>&nbsp;<\/li>\n\n\n\n<li>Hao, K. (2019). The future of AI research is in Africa. MIT Technology Review. <a href=\"https:\/\/www.technologyreview.com\/2019\/06\/21\/134820\/ai-africa-machine-learning-ibm-google\/\">https:\/\/www.technologyreview.com\/2019\/06\/21\/134820\/ai-africa-machine-learning-ibm-google\/<\/a>&nbsp;<\/li>\n\n\n\n<li>Holland, A. (2024). Feminist Ethics AI Toolkit. Sistah Sistah<\/li>\n\n\n\n<li>Jili, B. (2020, December 11). Surveillance tech in Africa stirs security concerns – Africa Center. Africa Center. <a href=\"https:\/\/africacenter.org\/spotlight\/surveillance-technology-in-africa-security-concerns\/\">https:\/\/africacenter.org\/spotlight\/surveillance-technology-in-africa-security-concerns\/<\/a>&nbsp;<\/li>\n\n\n\n<li>Perrigo, B. (2022, February 17). Inside Facebook’s African sweatshop. TIME. <a href=\"https:\/\/time.com\/6147458\/facebook-africa-content-moderation-employee-treatment\/\">https:\/\/time.com\/6147458\/facebook-africa-content-moderation-employee-treatment\/<\/a>&nbsp;<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>A liberatory AI ecosystem would transform bad labor conditions by ensuring that those most affected by technological systems have a say in how they are designed and governed.<\/p>\n","protected":false},"author":13,"featured_media":195,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[10],"tags":[],"coauthors":[21],"class_list":["post-253","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-ways-forward"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/posts\/253","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/comments?post=253"}],"version-history":[{"count":2,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/posts\/253\/revisions"}],"predecessor-version":[{"id":270,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/posts\/253\/revisions\/270"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/media\/195"}],"wp:attachment":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/media?parent=253"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/categories?post=253"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/tags?post=253"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/coauthors?post=253"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}