{"id":6,"name":"Isadora Cruxên","url":"","description":"Isadora Cruxên studies the political economy of development with a focus on Latin America and Brazil. Her recent work explores the politics of market-making and private investment in water infrastructures and in impact investing projects with a socio-environmental focus. This work bridges scholarship in development studies, political science, urban planning, and geography and engages issues such as financialisation, public-private collaboration, regulation, and business politics. \r\n\r\nAnother vein of her work examines the politics of knowledge production in relation to forms of social struggle and participatory methods of research and planning. As a research affiliate at the Data + Feminism Lab at MIT, she co-leads the collaborative action-research project called “Data Against Feminicide,” which aims to understand data activism about feminicide and gender-related violence and work with activists to co-design technological tools that support their work. Some of this research has been featured in Science. \r\n\r\nDr Cruxên holds a PhD in Political Economy, Development and Planning (2022) from the Massachusetts Institute of Technology (MIT), a Master in City Planning (2016) from MIT, and a bachelor’s degree in Political Science (2011) from the University of Brasília, Brazil.","link":"https:\/\/liberatoryai.datainfrastructures.org\/author\/isa\/","slug":"isa","avatar_urls":{"24":"https:\/\/secure.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=24","48":"https:\/\/secure.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=48","96":"https:\/\/secure.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=96"},"meta":[],"simple_local_avatar":null,"_links":{"self":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/users\/6","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/users"}]}}