{"id":2,"date":"2025-02-28T22:19:11","date_gmt":"2025-02-28T22:19:11","guid":{"rendered":"https:\/\/liberatoryai.datainfrastructures.org\/?page_id=2"},"modified":"2025-05-01T14:43:16","modified_gmt":"2025-05-01T14:43:16","slug":"about","status":"publish","type":"page","link":"https:\/\/liberatoryai.datainfrastructures.org\/about\/","title":{"rendered":"About"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\"><strong>Introduction<\/strong><\/h3>\n\n\n\n<p>What is artificial intelligence? Where and how is it being used? How are its harms and benefits distributed? Is it &#8220;intelligent&#8221;? Is it inevitable? What are our alternatives?<\/p>\n\n\n\n<p><a href=\"https:\/\/liberatoryai.datainfrastructures.org\/contributors\/\" title=\"Contributors\">Contributors<\/a> to the liberatory AI ecosystem project came together because we share an interest in answering these questions. We are a group of researchers, artists, and practitioners from a variety of disciplines and institutions united by our engagement in the current state of AI practice and theory.&nbsp;<\/p>\n\n\n\n<p>From its inception nearly <a href=\"https:\/\/www.britannica.com\/science\/history-of-artificial-intelligence\">100 years ago<\/a>, systems called artificial intelligence have been deployed in contexts as far-ranging as cryptography, healthcare, language translation, and music production.&nbsp; Early proto-AI systems included <a href=\"https:\/\/www.britannica.com\/topic\/chess\/Chess-and-artificial-intelligence\">chess-playing<\/a> algorithms and <a href=\"https:\/\/en.wikipedia.org\/wiki\/ELIZA\">therapy chatbots<\/a>.&nbsp; Today, AI systems are being incorporated into many spheres of everyday life. Students use ChatGPT to brainstorm project ideas, email programs run spam filters so that we only see relevant correspondence, landlords use AI systems to do background checks on tenants (more on this later). The technologies behind these systems are actually quite diverse. They include models that <em>structure<\/em> data (e.g., topic modeling, k-means clustering), that <em>classify<\/em> data (e.g., logistic regression, decision trees, convolutional neural networks), and that <em>generate<\/em> data (e.g., large language models, diffusion models).&nbsp;<\/p>\n\n\n\n<p>What unites these systems is not a particular technological approach, but the values, hype cycles, discourses through which they are planned and funded.&nbsp; That is, for the majority of AI systems being deployed today AI is not (only) a set of pattern-recognition techniques with data. It also encompasses a specific organization of material resources and, through the marketing and hype surrounding AI, proposes a certain ideological order of the world.&nbsp;<\/p>\n\n\n\n<p>As <a href=\"https:\/\/link-springer-com.libproxy.mit.edu\/article\/10.1007\/s13347-024-00817-w\">Luciano Floridi <\/a>and others have pointed out, we are in the middle of a significant AI hype cycle.&nbsp; As <a href=\"https:\/\/link.springer.com\/article\/10.1007\/s43681-024-00483-w\">Clea Borne’s research<\/a> has demonstrated, the hype cycle has been successful in part because it is based on pleas to emotion, framing AI as a “a panacea, silver bullet, miracle solution, universal remedy, and magic answer for any problem, question, or issue one may have.” &nbsp; The popularity of artificial intelligence, then, is not based on any specific technical nuance.&nbsp; Rather, AI’s popularity is based on speculation and rarely-fulfilled promises of ease and a better future.&nbsp;<\/p>\n\n\n\n<p>When we talk about AI, we’re sometimes talking about specific systems (e.g. Shotspotter) in specific locations (in Los Angeles).&nbsp; At other times, AI is not a computational system, but an ideological one – a complex network of values, ethics, priorities, and resources – that shape our material world.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Corporate AI Landscape<\/strong><\/h3>\n\n\n\n<p>Our investigations into AI begin with the current state of corporate AI.&nbsp; Our focus is on corporate AI specifically and not artificial intelligence as a sub discipline of computer science.&nbsp; Corporate AI draws attention to the very particular ways that corporations have set the terms of AI development. There are as many ways to approach AI development as there are innovative applications for AI technology, yet Corporate AI has set a precedent for developing AI in ways that are extractive, environmentally harmful, and colonialist.&nbsp;<\/p>\n\n\n\n<p>For example, as <a href=\"https:\/\/liberatoryai.datainfrastructures.org\/corporate-ai-is-bad-for-the-planet\/\" title=\"Corporate AI is bad for the planet.\">Amelia Dogan and Hongjin Lin write<\/a>, within corporate AI practices “the planet is treated as an externality—a resource to be exploited rather than a living entity to be respected.” They point to the ways that corporate AI is entrenched in approaches that do not consider the welfare of the natural environment.&nbsp; They echo our commitment to examining and denormalizing corporate AI approaches to resources:&nbsp; “[W]hile it’s great to talk about reducing AI’s carbon footprint, we also need to ask why AI is so resource-intensive in the first place. Is it because of technical necessity, or is it because corporations are chasing endless growth and profit?”&nbsp;<\/p>\n\n\n\n<p>Ololade Faniyi  builds on this critique<strong> <\/strong>as she explores the ways that Corporate AI harms extend beyond the natural environment to the people working on AI. Tech giants rely on invisible labor, much of which is performed in the Global South. &nbsp; So many of these violences go unreported because, <a href=\"https:\/\/liberatoryai.datainfrastructures.org\/corporate-ai-is-built-by-exploited-laborers\/\" title=\"Corporate AI is built by exploited laborers.\">as Faniyi notes<\/a>, “Workers are coerced into signing non-disclosure agreements that prevent them from speaking about their experiences &#8211; a contractual silencing that whistleblowers have accurately described as &#8220;modern-day slavery.&#8221;&nbsp;<\/p>\n\n\n\n<p>Throughout the essays, our contributors hold corporate AI to the highest standards, demanding that contemporary AI practice not perpetuate harms to the planet, to ourselves, and to viable futures for our communities.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Dead ends<\/strong><\/h3>\n\n\n\n<p>It can be tempting to try to articulate a better way forward for each problem articulated in the essays in the corporate AI section. But this is a trap—it limits our work to being reactive and only able to address the problems on the terms set by Corporate AI.&nbsp; Rather than trying to suggest a solution for each critique, we have to accept that some of the suggestions of corporate AI are dead ends.&nbsp;<\/p>\n\n\n\n<p>A dead end can be a stopping point because we reject the values that a particular approach prioritizes. For example, we are suspicious of attempts to make AI more “transparent” because transparency is not the same as accountability, and a system whose harms we understand is not better than a system that does not cause harm in the first pace.&nbsp;<\/p>\n\n\n\n<p>We also label some approaches dead ends&nbsp; because, frankly, we just don’t want to think about the problem in the way it has been described, and our time could be better spent elsewhere. &nbsp; For example, there are some contexts in which AI is simply not the solution.&nbsp; There is no amount of&nbsp; fast, accurate, “un-biased” or “objective” AI that can solve some types of problems, and we consider attempts to do this to be dead ends.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Ways Forward&nbsp;<\/strong><\/h3>\n\n\n\n<p>Our visions for other ways are not meant to be perfectly fitting solutions for the critiques and problems outlined above.&nbsp; Instead they are speculative, yet possible, visions for other ways to be in relationship to technology.&nbsp; They are visions of reclamation, of harm reduction. They are calls to action in a moment designed to engineer freeze responses. We do not believe these will solve every problem with AI but we also do not need to wait for perfect conditions to begin to rethink AI.<\/p>\n\n\n\n<p>For example, <a href=\"https:\/\/liberatoryai.datainfrastructures.org\/communities-decide-if-ai-is-working-for-them\/\" title=\"Communities decide if AI is working for them. \">Yujia Gao<\/a> reminds us that communities can set their own standards for evaluating AI systems.  Typically, AI systems are evaluated by the standards of their corporate creators.  Gao reminds us that “the failure to align evaluation metrics with community needs is not just a technical flaw &#8211; it is a structural issue rooted in capitalism and power asymmetries.”  However, there is another way.  <em>“<\/em>In a liberatory AI framework, evaluation is not an afterthought, a marketing tool, or a pretense of accountability &#8211; it is the fundamental process through which communities collaboratively define what &#8220;good AI&#8221; looks like, who it serves, and how it aligns with their collective values.” <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What’s next?<\/strong><\/h3>\n\n\n\n<p>We invite you to read and engage with the essays here, including each piece’s recommendations for further reading.&nbsp; As you read, you might find topics that we’ve missed, or that you think need a different treatment.&nbsp; We would love to have you join us in writing for the project, and get your help navigating the corporate landscape and the misleading dead ends. We are especially interested in your visions for liberation with (and without) AI.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction What is artificial intelligence? Where and how is it being used? How are its harms and benefits distributed? Is it &#8220;intelligent&#8221;? Is it inevitable? What are our alternatives? Contributors to the liberatory AI ecosystem project came together because we share an interest in answering these questions. We are a group of researchers, artists, and [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"inline_featured_image":false,"footnotes":""},"coauthors":[11],"class_list":["post-2","page","type-page","status-publish","hentry"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/pages\/2","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/comments?post=2"}],"version-history":[{"count":4,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/pages\/2\/revisions"}],"predecessor-version":[{"id":280,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/pages\/2\/revisions\/280"}],"wp:attachment":[{"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/media?parent=2"}],"wp:term":[{"taxonomy":"author","embeddable":true,"href":"https:\/\/liberatoryai.datainfrastructures.org\/wp-json\/wp\/v2\/coauthors?post=2"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}